export default class Section {
    constructor ({items, renderer},
        containerSelector) {


/*Свойство items — это массив данных, которые нужно добавить на страницу при инициализации класса. 
Свойство renderer — это функция, которая отвечает за создание и отрисовку данных на странице.
    */    
   
/*Второй параметр конструктора — селектор контейнера, в который нужно добавлять созданные элементы.
*/


        }

        renderer() {
    
        }

        addItem() {
            /* append to containerSelector */
        }


        /*Содержит публичный метод addItem, который принимает DOM-элемент и добавляет его в контейнер. */

}