export default class UserInfo {

    constructor(userName, userInfo){
        /*Принимает в конструктор объект с селекторами двух элементов: элемента имени пользователя и элемента информации о себе.*/
    }

    getUserInfo() {}
    /*Содержит публичный метод getUserInfo, который возвращает объект с данными пользователя. 
    Этот метод пригодится когда данные пользователя нужно будет подставить в форму при открытии.*/

    setUserInfo() {}
    /*Содержит публичный метод setUserInfo, который принимает новые данные пользователя и добавляет их на страницу.*/


}